#pragma once
#include "NWN2_API.h"

struct CNWSCreature{
	CNWSObject Object;
	DWORD dword1AC; //1AC
	DWORD dword1B0; //1B0
	DWORD dword1B4; //1B4
	DWORD dword1B8; //1B8
	DWORD dword1BC; //1BC
	DWORD dword1C0; //1C0
	DWORD dword1C4; //1C4
	DWORD dword1C8; //1C8
	DWORD dword1CC; //1CC
	DWORD dword1D0; //1D0
	DWORD dword1D4; //1D4
	DWORD dword1D8; //1D8
	DWORD dword1DC; //1DC
	DWORD dword1E0; //1E0
	nwn_objid_t objid1E4; //1E4
	nwn_objid_t objid1E8; //1E8
	nwn_objid_t objid1EC; //1EC
	nwn_objid_t objid1F0; //1F0
	nwn_objid_t objid1F4; //1F4
};